ghlualven/zephyr/include/zephyr/dt-bindings/timer/stm32-timer-h7.h
/*
  * Copyright (c) 2020 Teslabs Engineering S.L.
  *
  * SPDX-License-Identifier: Apache-2.0
  */
 #ifndef ZEPHYR_INCLUDE_DT_BINDINGS_TIMERS_STM32_TIMERS_H7_
 #define ZEPHYR_INCLUDE_DT_BINDINGS_TIMERS_STM32_TIMERS_H7_

 #include "stm32_timers.h"

 /* STM32 Timer Internal Trigger (ITR) settings for H7 series.
  *
  * Ref. Tables 329, 334, 337, 342. RM0433 Rev. 7.
  *
  * Naming convention: DT_STM32_TIMERS_<MASTER>_<SLAVE>_ITR.
  */
 #define DT_STM32_TIMERS_TIM1_TIM2_ITR	DT_STM32_TIMERS_TS_ITR0
 #define DT_STM32_TIMERS_TIM1_TIM3_ITR	DT_STM32_TIMERS_TS_ITR0
 #define DT_STM32_TIMERS_TIM1_TIM4_ITR	DT_STM32_TIMERS_TS_ITR0
 #define DT_STM32_TIMERS_TIM1_TIM5_ITR	DT_STM32_TIMERS_TS_ITR0
 #define DT_STM32_TIMERS_TIM1_TIM8_ITR	DT_STM32_TIMERS_TS_ITR0
 #define DT_STM32_TIMERS_TIM1_TIM15_ITR	DT_STM32_TIMERS_TS_ITR0

 #define DT_STM32_TIMERS_TIM2_TIM1_ITR	DT_STM32_TIMERS_TS_ITR1
 #define DT_STM32_TIMERS_TIM2_TIM3_ITR	DT_STM32_TIMERS_TS_ITR1
 #define DT_STM32_TIMERS_TIM2_TIM4_ITR	DT_STM32_TIMERS_TS_ITR1
 #define DT_STM32_TIMERS_TIM2_TIM8_ITR	DT_STM32_TIMERS_TS_ITR1

 #define DT_STM32_TIMERS_TIM3_TIM1_ITR	DT_STM32_TIMERS_TS_ITR2
 #define DT_STM32_TIMERS_TIM3_TIM2_ITR	DT_STM32_TIMERS_TS_ITR2
 #define DT_STM32_TIMERS_TIM3_TIM4_ITR	DT_STM32_TIMERS_TS_ITR2
 #define DT_STM32_TIMERS_TIM3_TIM5_ITR	DT_STM32_TIMERS_TS_ITR2
 #define DT_STM32_TIMERS_TIM3_TIM15_ITR	DT_STM32_TIMERS_TS_ITR1

 #define DT_STM32_TIMERS_TIM4_TIM1_ITR	DT_STM32_TIMERS_TS_ITR3
 #define DT_STM32_TIMERS_TIM4_TIM2_ITR	DT_STM32_TIMERS_TS_ITR3
 #define DT_STM32_TIMERS_TIM4_TIM3_ITR	DT_STM32_TIMERS_TS_ITR3
 #define DT_STM32_TIMERS_TIM4_TIM5_ITR	DT_STM32_TIMERS_TS_ITR3
 #define DT_STM32_TIMERS_TIM4_TIM8_ITR	DT_STM32_TIMERS_TS_ITR2
 #define DT_STM32_TIMERS_TIM4_TIM12_ITR	DT_STM32_TIMERS_TS_ITR0

 #define DT_STM32_TIMERS_TIM5_TIM8_ITR	DT_STM32_TIMERS_TS_ITR3
 #define DT_STM32_TIMERS_TIM5_TIM12_ITR	DT_STM32_TIMERS_TS_ITR1

 #define DT_STM32_TIMERS_TIM8_TIM2_ITR	DT_STM32_TIMERS_TS_ITR1
 #define DT_STM32_TIMERS_TIM8_TIM4_ITR	DT_STM32_TIMERS_TS_ITR3
 #define DT_STM32_TIMERS_TIM8_TIM5_ITR	DT_STM32_TIMERS_TS_ITR1

 #define DT_STM32_TIMERS_TIM15_TIM1_ITR	DT_STM32_TIMERS_TS_ITR0
 #define DT_STM32_TIMERS_TIM15_TIM3_ITR	DT_STM32_TIMERS_TS_ITR2

 #endif /* ZEPHYR_INCLUDE_DT_BINDINGS_TIMERS_STM32_TIMERS_H7_ */